Docs/Reference/Content/images/dependencies/net8.0/mmd/alloverit-logging-testing.mmd
flowchart LR
  alloverit-logging-testing["AllOverIt.Logging.Testing"]
  fluentassertions_7-1-0["FluentAssertions<br>v7.1.0"]
  system-configuration-configurationmanager_6-0-0["System.Configuration.ConfigurationManager<br>v6.0.0"]
  microsoft-extensions-logging-abstractions_10-0-8["Microsoft.Extensions.Logging.Abstractions<br>v10.0.8"]
  microsoft-extensions-dependencyinjection-abstractions_10-0-8["Microsoft.Extensions.DependencyInjection.Abstractions<br>v10.0.8"]
  system-diagnostics-diagnosticsource_10-0-8["System.Diagnostics.DiagnosticSource<br>v10.0.8"]
  nsubstitute_5-3-0["NSubstitute<br>v5.3.0"]
  castle-core_5-1-1["Castle.Core<br>v5.1.1"]
  alloverit-logging["AllOverIt.Logging"]
  alloverit["AllOverIt"]
  alloverit-assertion["AllOverIt.Assertion"]
  alloverit-logging-testing --> fluentassertions_7-1-0
  fluentassertions_7-1-0 --> system-configuration-configurationmanager_6-0-0
  alloverit-logging-testing --> microsoft-extensions-logging-abstractions_10-0-8
  microsoft-extensions-logging-abstractions_10-0-8 --> microsoft-extensions-dependencyinjection-abstractions_10-0-8
  microsoft-extensions-logging-abstractions_10-0-8 --> system-diagnostics-diagnosticsource_10-0-8
  alloverit-logging-testing --> nsubstitute_5-3-0
  nsubstitute_5-3-0 --> castle-core_5-1-1
  alloverit-logging-testing --> alloverit-logging
  alloverit-logging --> microsoft-extensions-logging-abstractions_10-0-8
  alloverit-logging --> alloverit
  alloverit --> alloverit-assertion
  style fluentassertions_7-1-0 fill:#ADD8E6,opacity:0.8
  style system-configuration-configurationmanager_6-0-0 fill:#FFEC96,opacity:0.8
  style microsoft-extensions-logging-abstractions_10-0-8 fill:#ADD8E6,opacity:0.8
  style microsoft-extensions-dependencyinjection-abstractions_10-0-8 fill:#FFEC96,opacity:0.8
  style system-diagnostics-diagnosticsource_10-0-8 fill:#FFEC96,opacity:0.8
  style nsubstitute_5-3-0 fill:#ADD8E6,opacity:0.8
  style castle-core_5-1-1 fill:#FFEC96,opacity:0.8
